webhooks/testdata/past_due_invoice_notification.xml

<?xml version="1.0" encoding="UTF-8"?>
<past_due_invoice_notification>
  <account>
      <account_code>1</account_code>
      <username nil="true">verena</username>
      <email>verena@example.com</email>
      <first_name>Verena</first_name>
      <last_name>Example</last_name>
      <company_name nil="true">Company, Inc.</company_name>
  </account>
  <invoice>
    <uuid>ffc64d71d4b5404e93f13aac9c63b007</uuid>
    <state>past_due</state>
    <invoice_number_prefix></invoice_number_prefix>
    <invoice_number type="integer">1000</invoice_number>
    <po_number></po_number>
    <vat_number></vat_number>
    <total_in_cents type="integer">1100</total_in_cents>
    <date type="datetime">2014-01-01T20:21:44Z</date>
  </invoice>
</past_due_invoice_notification>
